app/controllers/reports_controller.rb

  def index
    @total_urls = Url.count
    @analyzed_urls = Url.joins(:sentiment_analyses).distinct.count
    @pending_urls = @total_urls - @analyzed_urls

    @sentiment_breakdown = SentimentAnalysis.group(:sentiment).count

    @recent_analyses = SentimentAnalysis.includes(:url)
                                      .order(created_at: :desc)
                                      .limit(10)
---
SELECT COUNT(*) FROM "urls"
SELECT COUNT(DISTINCT "urls"."id") FROM "urls" INNER JOIN "sentiment_analyses" ON "sentiment_analyses"."url_id" = "urls"."id"
SELECT "urls".* FROM "urls" WHERE "urls"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9)