app/controllers/sentiment_analyses_controller.rb

  def create
    @sentiment_analysis = @url.sentiment_analyses.build

    begin
      @sentiment_analysis.analyze_sentiment

      if @sentiment_analysis.save
---
INSERT INTO "sentiment_analyses" ("url_id", "sentiment", "reasoning", "created_at", "updated_at") VALUES (1, 'unclear', 'Analysis failed: unknown keyword: :access_token', '2025-06-23 16:00:15.259286', '2025-06-23 16:00:15.259286') RETURNING "id"

  def set_url
    @url = Url.find(params[:url_id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = 1 LIMIT 1