app/controllers/urls_controller.rb

  def export
    @urls = Url.includes(:sentiment_analyses).order(created_at: :desc)

    respond_to do |format|
      format.csv do
        csv_data = CSV.generate(headers: true) do |csv|
          csv << [ "URL", "Sentiment", "Reasoning", "Analyzed At", "Created At" ]
---
INSERT INTO "urls" ("url", "created_at", "updated_at") VALUES ('https://theconversation.com/a-reversal-in-us-climate-policy-will-send-renewables-investors-packing-and-australia-can-reap-the-benefits-258388', '2025-06-23 19:19:00.638660', '2025-06-23 19:19:00.638660') RETURNING "id"

  def bulk_analyze
    pending_urls = Url.left_outer_joins(:sentiment_analyses).where(sentiment_analyses: { id: nil }).count

    Rails.logger.info "Bulk analyze requested. Found #{pending_urls} URLs without sentiment analyses"

    if pending_urls == 0
      Rails.logger.info "No pending URLs to analyze - redirecting"
      redirect_to urls_path, notice: "All URLs have already been analyzed."
      return
    end

    # Log which URLs will be analyzed
    pending_url_list = Url.left_outer_joins(:sentiment_analyses).where(sentiment_analyses: { id: nil })
    Rails.logger.info "URLs that will be analyzed:"
    pending_url_list.each { |url| Rails.logger.info "  - #{url.url}" }
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = NULL LIMIT 1

        end

        # Check for duplicates
        if Url.exists?(url: cleaned_url)
---
SELECT 1 AS one FROM "urls" WHERE "urls"."url" = 'https://theconversation.com/a-reversal-in-us-climate-policy-will-send-renewables-investors-packing-and-australia-can-reap-the-benefits-258388' LIMIT 1