app/controllers/urls_controller.rb

SELECT "sentiment_analyses".* FROM "sentiment_analyses" WHERE "sentiment_analyses"."url_id" = 1 ORDER BY "sentiment_analyses"."created_at" DESC LIMIT 1
SELECT "urls".* FROM "urls" ORDER BY "urls"."created_at" DESC
---
  def index
    @urls = Url.includes(:sentiment_analyses).order(created_at: :desc)

INSERT INTO "urls" ("url", "created_at", "updated_at") VALUES ('https://theconversation.com/a-reversal-in-us-climate-policy-will-send-renewables-investors-packing-and-australia-can-reap-the-benefits-258388', '2025-06-23 16:00:10.099480', '2025-06-23 16:00:10.099480') RETURNING "id"
---
  def create
    @url = Url.new(url_params)

    if @url.save

DELETE FROM "urls" WHERE "urls"."id" = 18
---
  def destroy
    @url.destroy

SELECT "urls".* FROM "urls" WHERE "urls"."id" = 1 LIMIT 1
---
  def bulk_analyze
    pending_urls = Url.left_outer_joins(:sentiment_analyses).where(sentiment_analyses: { id: nil }).count

    Rails.logger.info "Bulk analyze requested. Found #{pending_urls} URLs without sentiment analyses"

    if pending_urls == 0
      Rails.logger.info "No pending URLs to analyze - redirecting"
      redirect_to urls_path, notice: "All URLs have already been analyzed."
      return
    end

    # Log which URLs will be analyzed
    pending_url_list = Url.left_outer_joins(:sentiment_analyses).where(sentiment_analyses: { id: nil })
    Rails.logger.info "URLs that will be analyzed:"
    pending_url_list.each { |url| Rails.logger.info "  - #{url.url}" }

INSERT INTO "urls" ("url", "created_at", "updated_at") VALUES ('https://theconversation.com/a-reversal-in-us-climate-policy-will-send-renewables-investors-packing-and-australia-can-reap-the-benefits-258388', '2025-06-23 19:19:00.638660', '2025-06-23 19:19:00.638660') RETURNING "id"
---
  def process_bulk_import
    if params[:file].blank?
      redirect_to bulk_import_urls_path, alert: "Please select a file to upload."
      return
    end

    file = params[:file]
    file_extension = File.extname(file.original_filename).downcase

    unless [ ".csv", ".xls", ".xlsx" ].include?(file_extension)
      redirect_to bulk_import_urls_path, alert: "Please upload a CSV or Excel file (.csv, .xls, .xlsx)."
      return
    end

    begin
      urls = parse_spreadsheet(file)
      imported_count = 0
      errors = []

      urls.each_with_index do |url_string, index|
        next if url_string.blank?

        url = Url.new(url: url_string.strip)
        if url.save

SELECT "urls".* FROM "urls" WHERE "urls"."id" = 20 LIMIT 1
---
  def set_url
    @url = Url.find(params[:id])