app/jobs/bulk_sentiment_analysis_job.rb

  def perform(session_id)
    Rails.logger.info "Starting BulkSentimentAnalysisJob with session_id: #{session_id}"

    # Get URLs that don't have any sentiment analyses yet
    urls = Url.left_outer_joins(:sentiment_analyses).where(sentiment_analyses: { id: nil })
    total_urls = urls.count
    processed_count = 0

    Rails.logger.info "Found #{total_urls} URLs to analyze (only URLs without existing analyses)"

    if total_urls == 0
      Rails.logger.info "No URLs need analysis - all URLs already have sentiment analyses"
      return
    end

    Rails.logger.info "URLs to be analyzed:"
    urls.each { |url| Rails.logger.info "  - #{url.url}" }

    urls.find_each do |url|
      begin
        Rails.logger.info "Analyzing URL #{url.id}: #{url.url}"

        # Create sentiment analysis for this URL
        sentiment_analysis = url.sentiment_analyses.build
        sentiment_analysis.analyze_sentiment
        sentiment_analysis.save!
---
INSERT INTO "sentiment_analyses" ("url_id", "sentiment", "reasoning", "created_at", "updated_at") VALUES (10, 'unclear', 'Could not fetch content from the URL. Please check if the URL is accessible.', '2025-06-24 02:13:25.613845', '2025-06-24 02:13:25.613845') RETURNING "id"